package HomeWork1;

public class HomeWork2_7 {
    public static void main(String[] args) {
        int a = 2;
        int b = 8;
        /* В исходном примере в тернарном операторе вместо численного выражения указано логическое условие 68 >= 68. Компилятор выдает ошибку
         Поскольку исходное условие оператора 5 + 7 > 20 равняется false, то выражение 68 >= 68 никогда не будет выполняться (по сути его значение нам не важно)
         Для работы компилятора и решения примера попробуем заменить часть "68 >= 68" на int из следующей логики. Выражение 68>=68 имеет значение true, заменим его на 1*/

        System.out.println((5 + 7 > 20 ?  1 : 22 * 2 >> a++) / --b);
        /*1) инициализация а=2
        2) инициализация b=8
        3) действие в скобках (5 + 7 > 20 ? 1 : 22 * 2 >> 2++)
        4) тернарный оператор
        5) проверяется boolean 5+7 > 20 / 12 > 20 / false
        6) выполняется условие else 22 * 2 >> 2 ++
        7) выполняется умножение 22 * 2 = 44
        8) сдвиг вправо 44 >> 2 = 11 answer = 11
        9) постунарный оператор а++ = а + 1 = 2 + 1 = 3
        10) префикс унарный --b = b - 1 = 8 - 1 = 7
        11) деление 11 / 7 = 1*/
    }



}
