package HomeWork1;

public class HomeWork2_6 {
    public static void main(String[] args) {
        int a = 2;
        int b = 8;

        System.out.println((5 + 7 > 20 ? 68 : 22 * 2 >> a ++ )/ --b);

        /*1) инициализация а=2
        2) инициализация b=8
        3) действие в скобках (5 + 7 > 20 ? 68 : 22 * 2 >> 2++)
        4) тернарный оператор
        5) проверяется boolean 5+7 > 20 / 12 > 20 / false
        6) выполняется условие else 22 * 2 >> 2  ++
        7) выполняется умножение 22 * 2 = 44
        8) сдвиг вправо 44 >> 2 = 11 answer = 11
        9) постунарный оператор а++ = а + 1 = 2 + 1 = 3
        10) префикс унарный --b = b - 1 = 8 - 1 = 7
        11) деление 11 / 7 = 1*/
    }
}
